MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX570F512H.atdf
         <value caption="Memory below 0x37400 address is write-protected" name="PWP221K" value="0x322" />
         <value caption="Memory below 0x37800 address is write-protected" name="PWP222K" value="0x321" />
         <value caption="Memory below 0x37C00 address is write-protected" name="PWP223K" value="0x320" />
         <value caption="Memory below 0x38000 address is write-protected" name="PWP224K" value="0x31f" />
         <value caption="Memory below 0x38400 address is write-protected" name="PWP225K" value="0x31e" />
         <value caption="Memory below 0x38800 address is write-protected" name="PWP226K" value="0x31d" />
         <value caption="Memory below 0x38C00 address is write-protected" name="PWP227K" value="0x31c" />
         <value caption="Memory below 0x39000 address is write-protected" name="PWP228K" value="0x31b" />
         <value caption="Memory below 0x39400 address is write-protected" name="PWP229K" value="0x31a" />
         <value caption="Memory below 0x39800 address is write-protected" name="PWP230K" value="0x319" />
         <value caption="Memory below 0x39C00 address is write-protected" name="PWP231K" value="0x318" />
         <value caption="Memory below 0x3A000 address is write-protected" name="PWP232K" value="0x317" />
         <value caption="Memory below 0x3A400 address is write-protected" name="PWP233K" value="0x316" />
         <value caption="Memory below 0x3A800 address is write-protected" name="PWP234K" value="0x315" />
         <value caption="Memory below 0x3AC00 address is write-protected" name="PWP235K" value="0x314" />
         <value caption="Memory below 0x3B000 address is write-protected" name="PWP236K" value="0x313" />
         <value caption="Memory below 0x3B400 address is write-protected" name="PWP237K" value="0x312" />
         <value caption="Memory below 0x3B800 address is write-protected" name="PWP238K" value="0x311" />
         <value caption="Memory below 0x3BC00 address is write-protected" name="PWP239K" value="0x310" />
         <value caption="Memory below 0x3C000 address is write-protected" name="PWP240K" value="0x30f" />
         <value caption="Memory below 0x3C400 address is write-protected" name="PWP241K" value="0x30e" />
         <value caption="Memory below 0x3C800 address is write-protected" name="PWP242K" value="0x30d" />
         <value caption="Memory below 0x3CC00 address is write-protected" name="PWP243K" value="0x30c" />
         <value caption="Memory below 0x3D000 address is write-protected" name="PWP244K" value="0x30b" />
         <value caption="Memory below 0x3D400 address is write-protected" name="PWP245K" value="0x30a" />
         <value caption="Memory below 0x3D800 address is write-protected" name="PWP246K" value="0x309" />
         <value caption="Memory below 0x3DC00 address is write-protected" name="PWP247K" value="0x308" />
         <value caption="Memory below 0x3E000 address is write-protected" name="PWP248K" value="0x307" />
         <value caption="Memory below 0x3E400 address is write-protected" name="PWP249K" value="0x306" />
         <value caption="Memory below 0x3E800 address is write-protected" name="PWP250K" value="0x305" />
         <value caption="Memory below 0x3EC00 address is write-protected" name="PWP251K" value="0x304" />
         <value caption="Memory below 0x3F000 address is write-protected" name="PWP252K" value="0x303" />
         <value caption="Memory below 0x3F400 address is write-protected" name="PWP253K" value="0x302" />
         <value caption="Memory below 0x3F800 address is write-protected" name="PWP254K" value="0x301" />
         <value caption="Memory below 0x3FC00 address is write-protected" name="PWP255K" value="0x300" />
         <value caption="Memory below 0x40000 address is write-protected" name="PWP256K" value="0x2ff" />
         <value caption="Memory below 0x40400 address is write-protected" name="PWP257K" value="0x2fe" />
         <value caption="Memory below 0x40800 address is write-protected" name="PWP258K" value="0x2fd" />
         <value caption="Memory below 0x40C00 address is write-protected" name="PWP259K" value="0x2fc" />
         <value caption="Memory below 0x41000 address is write-protected" name="PWP260K" value="0x2fb" />
         <value caption="Memory below 0x41400 address is write-protected" name="PWP261K" value="0x2fa" />
         <value caption="Memory below 0x41800 address is write-protected" name="PWP262K" value="0x2f9" />
         <value caption="Memory below 0x41C00 address is write-protected" name="PWP263K" value="0x2f8" />
         <value caption="Memory below 0x42000 address is write-protected" name="PWP264K" value="0x2f7" />
         <value caption="Memory below 0x42400 address is write-protected" name="PWP265K" value="0x2f6" />
         <value caption="Memory below 0x42800 address is write-protected" name="PWP266K" value="0x2f5" />
         <value caption="Memory below 0x42C00 address is write-protected" name="PWP267K" value="0x2f4" />
         <value caption="Memory below 0x43000 address is write-protected" name="PWP268K" value="0x2f3" />
         <value caption="Memory below 0x43400 address is write-protected" name="PWP269K" value="0x2f2" />
         <value caption="Memory below 0x43800 address is write-protected" name="PWP270K" value="0x2f1" />
         <value caption="Memory below 0x43C00 address is write-protected" name="PWP271K" value="0x2f0" />
         <value caption="Memory below 0x44000 address is write-protected" name="PWP272K" value="0x2ef" />
         <value caption="Memory below 0x44400 address is write-protected" name="PWP273K" value="0x2ee" />
         <value caption="Memory below 0x44800 address is write-protected" name="PWP274K" value="0x2ed" />
         <value caption="Memory below 0x44C00 address is write-protected" name="PWP275K" value="0x2ec" />
         <value caption="Memory below 0x45000 address is write-protected" name="PWP276K" value="0x2eb" />
         <value caption="Memory below 0x45400 address is write-protected" name="PWP277K" value="0x2ea" />
         <value caption="Memory below 0x45800 address is write-protected" name="PWP278K" value="0x2e9" />
         <value caption="Memory below 0x45C00 address is write-protected" name="PWP279K" value="0x2e8" />
         <value caption="Memory below 0x46000 address is write-protected" name="PWP280K" value="0x2e7" />
         <value caption="Memory below 0x46400 address is write-protected" name="PWP281K" value="0x2e6" />
         <value caption="Memory below 0x46800 address is write-protected" name="PWP282K" value="0x2e5" />
         <value caption="Memory below 0x46C00 address is write-protected" name="PWP283K" value="0x2e4" />
         <value caption="Memory below 0x47000 address is write-protected" name="PWP284K" value="0x2e3" />
         <value caption="Memory below 0x47400 address is write-protected" name="PWP285K" value="0x2e2" />
         <value caption="Memory below 0x47800 address is write-protected" name="PWP286K" value="0x2e1" />
         <value caption="Memory below 0x47C00 address is write-protected" name="PWP287K" value="0x2e0" />
         <value caption="Memory below 0x48000 address is write-protected" name="PWP288K" value="0x2df" />
         <value caption="Memory below 0x48400 address is write-protected" name="PWP289K" value="0x2de" />
         <value caption="Memory below 0x48800 address is write-protected" name="PWP290K" value="0x2dd" />
         <value caption="Memory below 0x48C00 address is write-protected" name="PWP291K" value="0x2dc" />
         <value caption="Memory below 0x49000 address is write-protected" name="PWP292K" value="0x2db" />
         <value caption="Memory below 0x49400 address is write-protected" name="PWP293K" value="0x2da" />
         <value caption="Memory below 0x49800 address is write-protected" name="PWP294K" value="0x2d9" />
         <value caption="Memory below 0x49C00 address is write-protected" name="PWP295K" value="0x2d8" />
         <value caption="Memory below 0x4A000 address is write-protected" name="PWP296K" value="0x2d7" />
         <value caption="Memory below 0x4A400 address is write-protected" name="PWP297K" value="0x2d6" />
         <value caption="Memory below 0x4A800 address is write-protected" name="PWP298K" value="0x2d5" />
         <value caption="Memory below 0x4AC00 address is write-protected" name="PWP299K" value="0x2d4" />
         <value caption="Memory below 0x4B000 address is write-protected" name="PWP300K" value="0x2d3" />
         <value caption="Memory below 0x4B400 address is write-protected" name="PWP301K" value="0x2d2" />
         <value caption="Memory below 0x4B800 address is write-protected" name="PWP302K" value="0x2d1" />
         <value caption="Memory below 0x4BC00 address is write-protected" name="PWP303K" value="0x2d0" />
         <value caption="Memory below 0x4C000 address is write-protected" name="PWP304K" value="0x2cf" />
         <value caption="Memory below 0x4C400 address is write-protected" name="PWP305K" value="0x2ce" />
         <value caption="Memory below 0x4C800 address is write-protected" name="PWP306K" value="0x2cd" />
         <value caption="Memory below 0x4CC00 address is write-protected" name="PWP307K" value="0x2cc" />
         <value caption="Memory below 0x4D000 address is write-protected" name="PWP308K" value="0x2cb" />
         <value caption="Memory below 0x4D400 address is write-protected" name="PWP309K" value="0x2ca" />
         <value caption="Memory below 0x4D800 address is write-protected" name="PWP310K" value="0x2c9" />
         <value caption="Memory below 0x4DC00 address is write-protected" name="PWP311K" value="0x2c8" />
         <value caption="Memory below 0x4E000 address is write-protected" name="PWP312K" value="0x2c7" />
         <value caption="Memory below 0x4E400 address is write-protected" name="PWP313K" value="0x2c6" />
         <value caption="Memory below 0x4E800 address is write-protected" name="PWP314K" value="0x2c5" />
         <value caption="Memory below 0x4EC00 address is write-protected" name="PWP315K" value="0x2c4" />
         <value caption="Memory below 0x4F000 address is write-protected" name="PWP316K" value="0x2c3" />
         <value caption="Memory below 0x4F400 address is write-protected" name="PWP317K" value="0x2c2" />
         <value caption="Memory below 0x4F800 address is write-protected" name="PWP318K" value="0x2c1" />
         <value caption="Memory below 0x4FC00 address is write-protected" name="PWP319K" value="0x2c0" />
         <value caption="Memory below 0x50000 address is write-protected" name="PWP320K" value="0x2bf" />
         <value caption="Memory below 0x50400 address is write-protected" name="PWP321K" value="0x2be" />
         <value caption="Memory below 0x50800 address is write-protected" name="PWP322K" value="0x2bd" />
         <value caption="Memory below 0x50C00 address is write-protected" name="PWP323K" value="0x2bc" />
         <value caption="Memory below 0x51000 address is write-protected" name="PWP324K" value="0x2bb" />
         <value caption="Memory below 0x51400 address is write-protected" name="PWP325K" value="0x2ba" />
         <value caption="Memory below 0x51800 address is write-protected" name="PWP326K" value="0x2b9" />
         <value caption="Memory below 0x51C00 address is write-protected" name="PWP327K" value="0x2b8" />
         <value caption="Memory below 0x52000 address is write-protected" name="PWP328K" value="0x2b7" />
         <value caption="Memory below 0x52400 address is write-protected" name="PWP329K" value="0x2b6" />
         <value caption="Memory below 0x52800 address is write-protected" name="PWP330K" value="0x2b5" />
         <value caption="Memory below 0x52C00 address is write-protected" name="PWP331K" value="0x2b4" />
         <value caption="Memory below 0x53000 address is write-protected" name="PWP332K" value="0x2b3" />
         <value caption="Memory below 0x53400 address is write-protected" name="PWP333K" value="0x2b2" />
         <value caption="Memory below 0x53800 address is write-protected" name="PWP334K" value="0x2b1" />
         <value caption="Memory below 0x53C00 address is write-protected" name="PWP335K" value="0x2b0" />
         <value caption="Memory below 0x54000 address is write-protected" name="PWP336K" value="0x2af" />
         <value caption="Memory below 0x54400 address is write-protected" name="PWP337K" value="0x2ae" />
         <value caption="Memory below 0x54800 address is write-protected" name="PWP338K" value="0x2ad" />
         <value caption="Memory below 0x54C00 address is write-protected" name="PWP339K" value="0x2ac" />
         <value caption="Memory below 0x55000 address is write-protected" name="PWP340K" value="0x2ab" />
         <value caption="Memory below 0x55400 address is write-protected" name="PWP341K" value="0x2aa" />
         <value caption="Memory below 0x55800 address is write-protected" name="PWP342K" value="0x2a9" />
         <value caption="Memory below 0x55C00 address is write-protected" name="PWP343K" value="0x2a8" />
         <value caption="Memory below 0x56000 address is write-protected" name="PWP344K" value="0x2a7" />
         <value caption="Memory below 0x56400 address is write-protected" name="PWP345K" value="0x2a6" />
         <value caption="Memory below 0x56800 address is write-protected" name="PWP346K" value="0x2a5" />
         <value caption="Memory below 0x56C00 address is write-protected" name="PWP347K" value="0x2a4" />
         <value caption="Memory below 0x57000 address is write-protected" name="PWP348K" value="0x2a3" />
         <value caption="Memory below 0x57400 address is write-protected" name="PWP349K" value="0x2a2" />
         <value caption="Memory below 0x57800 address is write-protected" name="PWP350K" value="0x2a1" />
         <value caption="Memory below 0x57C00 address is write-protected" name="PWP351K" value="0x2a0" />
         <value caption="Memory below 0x58000 address is write-protected" name="PWP352K" value="0x29f" />
         <value caption="Memory below 0x58400 address is write-protected" name="PWP353K" value="0x29e" />
         <value caption="Memory below 0x58800 address is write-protected" name="PWP354K" value="0x29d" />
         <value caption="Memory below 0x58C00 address is write-protected" name="PWP355K" value="0x29c" />
         <value caption="Memory below 0x59000 address is write-protected" name="PWP356K" value="0x29b" />
         <value caption="Memory below 0x59400 address is write-protected" name="PWP357K" value="0x29a" />
         <value caption="Memory below 0x59800 address is write-protected" name="PWP358K" value="0x299" />
         <value caption="Memory below 0x59C00 address is write-protected" name="PWP359K" value="0x298" />
         <value caption="Memory below 0x5A000 address is write-protected" name="PWP360K" value="0x297" />
         <value caption="Memory below 0x5A400 address is write-protected" name="PWP361K" value="0x296" />
         <value caption="Memory below 0x5A800 address is write-protected" name="PWP362K" value="0x295" />
         <value caption="Memory below 0x5AC00 address is write-protected" name="PWP363K" value="0x294" />
         <value caption="Memory below 0x5B000 address is write-protected" name="PWP364K" value="0x293" />
         <value caption="Memory below 0x5B400 address is write-protected" name="PWP365K" value="0x292" />
         <value caption="Memory below 0x5B800 address is write-protected" name="PWP366K" value="0x291" />
         <value caption="Memory below 0x5BC00 address is write-protected" name="PWP367K" value="0x290" />
         <value caption="Memory below 0x5C000 address is write-protected" name="PWP368K" value="0x28f" />
         <value caption="Memory below 0x5C400 address is write-protected" name="PWP369K" value="0x28e" />
         <value caption="Memory below 0x5C800 address is write-protected" name="PWP370K" value="0x28d" />
         <value caption="Memory below 0x5CC00 address is write-protected" name="PWP371K" value="0x28c" />
         <value caption="Memory below 0x5D000 address is write-protected" name="PWP372K" value="0x28b" />
         <value caption="Memory below 0x5D400 address is write-protected" name="PWP373K" value="0x28a" />
         <value caption="Memory below 0x5D800 address is write-protected" name="PWP374K" value="0x289" />
         <value caption="Memory below 0x5DC00 address is write-protected" name="PWP375K" value="0x288" />
         <value caption="Memory below 0x5E000 address is write-protected" name="PWP376K" value="0x287" />
         <value caption="Memory below 0x5E400 address is write-protected" name="PWP377K" value="0x286" />
         <value caption="Memory below 0x5E800 address is write-protected" name="PWP378K" value="0x285" />
         <value caption="Memory below 0x5EC00 address is write-protected" name="PWP379K" value="0x284" />
         <value caption="Memory below 0x5F000 address is write-protected" name="PWP380K" value="0x283" />
         <value caption="Memory below 0x5F400 address is write-protected" name="PWP381K" value="0x282" />
         <value caption="Memory below 0x5F800 address is write-protected" name="PWP382K" value="0x281" />
         <value caption="Memory below 0x5FC00 address is write-protected" name="PWP383K" value="0x280" />
         <value caption="Memory below 0x60000 address is write-protected" name="PWP384K" value="0x27f" />
         <value caption="Memory below 0x60400 address is write-protected" name="PWP385K" value="0x27e" />
         <value caption="Memory below 0x60800 address is write-protected" name="PWP386K" value="0x27d" />
         <value caption="Memory below 0x60C00 address is write-protected" name="PWP387K" value="0x27c" />
         <value caption="Memory below 0x61000 address is write-protected" name="PWP388K" value="0x27b" />
         <value caption="Memory below 0x61400 address is write-protected" name="PWP389K" value="0x27a" />
         <value caption="Memory below 0x61800 address is write-protected" name="PWP390K" value="0x279" />
         <value caption="Memory below 0x61C00 address is write-protected" name="PWP391K" value="0x278" />
         <value caption="Memory below 0x62000 address is write-protected" name="PWP392K" value="0x277" />
         <value caption="Memory below 0x62400 address is write-protected" name="PWP393K" value="0x276" />
         <value caption="Memory below 0x62800 address is write-protected" name="PWP394K" value="0x275" />
         <value caption="Memory below 0x62C00 address is write-protected" name="PWP395K" value="0x274" />
         <value caption="Memory below 0x63000 address is write-protected" name="PWP396K" value="0x273" />
         <value caption="Memory below 0x63400 address is write-protected" name="PWP397K" value="0x272" />
         <value caption="Memory below 0x63800 address is write-protected" name="PWP398K" value="0x271" />
         <value caption="Memory below 0x63C00 address is write-protected" name="PWP399K" value="0x270" />
         <value caption="Memory below 0x64000 address is write-protected" name="PWP400K" value="0x26f" />
         <value caption="Memory below 0x64400 address is write-protected" name="PWP401K" value="0x26e" />
         <value caption="Memory below 0x64800 address is write-protected" name="PWP402K" value="0x26d" />
         <value caption="Memory below 0x64C00 address is write-protected" name="PWP403K" value="0x26c" />
         <value caption="Memory below 0x65000 address is write-protected" name="PWP404K" value="0x26b" />
         <value caption="Memory below 0x65400 address is write-protected" name="PWP405K" value="0x26a" />
         <value caption="Memory below 0x65800 address is write-protected" name="PWP406K" value="0x269" />
         <value caption="Memory below 0x65C00 address is write-protected" name="PWP407K" value="0x268" />
         <value caption="Memory below 0x66000 address is write-protected" name="PWP408K" value="0x267" />
         <value caption="Memory below 0x66400 address is write-protected" name="PWP409K" value="0x266" />
         <value caption="Memory below 0x66800 address is write-protected" name="PWP410K" value="0x265" />
         <value caption="Memory below 0x66C00 address is write-protected" name="PWP411K" value="0x264" />
         <value caption="Memory below 0x67000 address is write-protected" name="PWP412K" value="0x263" />
         <value caption="Memory below 0x67400 address is write-protected" name="PWP413K" value="0x262" />
         <value caption="Memory below 0x67800 address is write-protected" name="PWP414K" value="0x261" />
         <value caption="Memory below 0x67C00 address is write-protected" name="PWP415K" value="0x260" />
         <value caption="Memory below 0x68000 address is write-protected" name="PWP416K" value="0x25f" />
         <value caption="Memory below 0x68400 address is write-protected" name="PWP417K" value="0x25e" />
         <value caption="Memory below 0x68800 address is write-protected" name="PWP418K" value="0x25d" />
         <value caption="Memory below 0x68C00 address is write-protected" name="PWP419K" value="0x25c" />
         <value caption="Memory below 0x69000 address is write-protected" name="PWP420K" value="0x25b" />
         <value caption="Memory below 0x69400 address is write-protected" name="PWP421K" value="0x25a" />
         <value caption="Memory below 0x69800 address is write-protected" name="PWP422K" value="0x259" />
         <value caption="Memory below 0x69C00 address is write-protected" name="PWP423K" value="0x258" />
         <value caption="Memory below 0x6A000 address is write-protected" name="PWP424K" value="0x257" />
         <value caption="Memory below 0x6A400 address is write-protected" name="PWP425K" value="0x256" />
         <value caption="Memory below 0x6A800 address is write-protected" name="PWP426K" value="0x255" />
         <value caption="Memory below 0x6AC00 address is write-protected" name="PWP427K" value="0x254" />
         <value caption="Memory below 0x6B000 address is write-protected" name="PWP428K" value="0x253" />
         <value caption="Memory below 0x6B400 address is write-protected" name="PWP429K" value="0x252" />
         <value caption="Memory below 0x6B800 address is write-protected" name="PWP430K" value="0x251" />
         <value caption="Memory below 0x6BC00 address is write-protected" name="PWP431K" value="0x250" />
         <value caption="Memory below 0x6C000 address is write-protected" name="PWP432K" value="0x24f" />
         <value caption="Memory below 0x6C400 address is write-protected" name="PWP433K" value="0x24e" />
         <value caption="Memory below 0x6C800 address is write-protected" name="PWP434K" value="0x24d" />
         <value caption="Memory below 0x6CC00 address is write-protected" name="PWP435K" value="0x24c" />
         <value caption="Memory below 0x6D000 address is write-protected" name="PWP436K" value="0x24b" />
         <value caption="Memory below 0x6D400 address is write-protected" name="PWP437K" value="0x24a" />
         <value caption="Memory below 0x6D800 address is write-protected" name="PWP438K" value="0x249" />
         <value caption="Memory below 0x6DC00 address is write-protected" name="PWP439K" value="0x248" />
         <value caption="Memory below 0x6E000 address is write-protected" name="PWP440K" value="0x247" />
         <value caption="Memory below 0x6E400 address is write-protected" name="PWP441K" value="0x246" />
         <value caption="Memory below 0x6E800 address is write-protected" name="PWP442K" value="0x245" />
         <value caption="Memory below 0x6EC00 address is write-protected" name="PWP443K" value="0x244" />
         <value caption="Memory below 0x6F000 address is write-protected" name="PWP444K" value="0x243" />
         <value caption="Memory below 0x6F400 address is write-protected" name="PWP445K" value="0x242" />
         <value caption="Memory below 0x6F800 address is write-protected" name="PWP446K" value="0x241" />
