MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX570F512H.atdf
      <value-group caption="Channel Abort IRQ Enable bit" name="DCH3ECON__AIRQEN">
         <value caption="Channel transfer is aborted if an interrupt matching CHAIRQ occurs" name="" value="0x1" />
         <value caption="Interrupt number CHAIRQ is ignored and does not terminate a transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Start IRQ Enable bit" name="DCH3ECON__SIRQEN">
         <value caption="Start channel cell transfer if an interrupt matching CHSIRQ occurs" name="" value="0x1" />
         <value caption="Interrupt number CHSIRQ is ignored and does not start a transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Pattern Match Abort Enable bit" name="DCH3ECON__PATEN">
         <value caption="Abort transfer and clear CHEN on pattern match" name="" value="0x1" />
         <value caption="Pattern match is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Abort Transfer bit" name="DCH3ECON__CABORT">
         <value caption="A DMA transfer is aborted when this bit is written to a 1" name="" value="0x1" />
         <value caption="This bit always reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Forced Transfer bit" name="DCH3ECON__CFORCE">
         <value caption="A DMA transfer is forced to begin when this bit is written to a 1" name="" value="0x1" />
         <value caption="This bit always reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Transfer Start IRQ bits" name="DCH3ECON__CHSIRQ">
         <value caption="Interrupt 255 will initiate a DMA transfer" name="" value="0xff" />
         <value caption="Interrupt 254 will initiate a DMA transfer" name="" value="0xfe" />
         <value caption="Interrupt 253 will initiate a DMA transfer" name="" value="0xfd" />
         <value caption="Interrupt 252 will initiate a DMA transfer" name="" value="0xfc" />
         <value caption="Interrupt 251 will initiate a DMA transfer" name="" value="0xfb" />
         <value caption="Interrupt 250 will initiate a DMA transfer" name="" value="0xfa" />
         <value caption="Interrupt 249 will initiate a DMA transfer" name="" value="0xf9" />
         <value caption="Interrupt 248 will initiate a DMA transfer" name="" value="0xf8" />
         <value caption="Interrupt 247 will initiate a DMA transfer" name="" value="0xf7" />
         <value caption="Interrupt 246 will initiate a DMA transfer" name="" value="0xf6" />
         <value caption="Interrupt 245 will initiate a DMA transfer" name="" value="0xf5" />
         <value caption="Interrupt 244 will initiate a DMA transfer" name="" value="0xf4" />
         <value caption="Interrupt 243 will initiate a DMA transfer" name="" value="0xf3" />
         <value caption="Interrupt 242 will initiate a DMA transfer" name="" value="0xf2" />
         <value caption="Interrupt 241 will initiate a DMA transfer" name="" value="0xf1" />
         <value caption="Interrupt 240 will initiate a DMA transfer" name="" value="0xf0" />
         <value caption="Interrupt 239 will initiate a DMA transfer" name="" value="0xef" />
         <value caption="Interrupt 238 will initiate a DMA transfer" name="" value="0xee" />
         <value caption="Interrupt 237 will initiate a DMA transfer" name="" value="0xed" />
         <value caption="Interrupt 236 will initiate a DMA transfer" name="" value="0xec" />
         <value caption="Interrupt 235 will initiate a DMA transfer" name="" value="0xeb" />
         <value caption="Interrupt 234 will initiate a DMA transfer" name="" value="0xea" />
         <value caption="Interrupt 233 will initiate a DMA transfer" name="" value="0xe9" />
         <value caption="Interrupt 232 will initiate a DMA transfer" name="" value="0xe8" />
         <value caption="Interrupt 231 will initiate a DMA transfer" name="" value="0xe7" />
         <value caption="Interrupt 230 will initiate a DMA transfer" name="" value="0xe6" />
         <value caption="Interrupt 229 will initiate a DMA transfer" name="" value="0xe5" />
         <value caption="Interrupt 228 will initiate a DMA transfer" name="" value="0xe4" />
         <value caption="Interrupt 227 will initiate a DMA transfer" name="" value="0xe3" />
         <value caption="Interrupt 226 will initiate a DMA transfer" name="" value="0xe2" />
         <value caption="Interrupt 225 will initiate a DMA transfer" name="" value="0xe1" />
         <value caption="Interrupt 224 will initiate a DMA transfer" name="" value="0xe0" />
         <value caption="Interrupt 223 will initiate a DMA transfer" name="" value="0xdf" />
         <value caption="Interrupt 222 will initiate a DMA transfer" name="" value="0xde" />
         <value caption="Interrupt 221 will initiate a DMA transfer" name="" value="0xdd" />
         <value caption="Interrupt 220 will initiate a DMA transfer" name="" value="0xdc" />
         <value caption="Interrupt 219 will initiate a DMA transfer" name="" value="0xdb" />
         <value caption="Interrupt 218 will initiate a DMA transfer" name="" value="0xda" />
         <value caption="Interrupt 217 will initiate a DMA transfer" name="" value="0xd9" />
         <value caption="Interrupt 216 will initiate a DMA transfer" name="" value="0xd8" />
         <value caption="Interrupt 215 will initiate a DMA transfer" name="" value="0xd7" />
         <value caption="Interrupt 214 will initiate a DMA transfer" name="" value="0xd6" />
         <value caption="Interrupt 213 will initiate a DMA transfer" name="" value="0xd5" />
         <value caption="Interrupt 212 will initiate a DMA transfer" name="" value="0xd4" />
         <value caption="Interrupt 211 will initiate a DMA transfer" name="" value="0xd3" />
         <value caption="Interrupt 210 will initiate a DMA transfer" name="" value="0xd2" />
         <value caption="Interrupt 209 will initiate a DMA transfer" name="" value="0xd1" />
         <value caption="Interrupt 208 will initiate a DMA transfer" name="" value="0xd0" />
         <value caption="Interrupt 207 will initiate a DMA transfer" name="" value="0xcf" />
         <value caption="Interrupt 206 will initiate a DMA transfer" name="" value="0xce" />
         <value caption="Interrupt 205 will initiate a DMA transfer" name="" value="0xcd" />
         <value caption="Interrupt 204 will initiate a DMA transfer" name="" value="0xcc" />
         <value caption="Interrupt 203 will initiate a DMA transfer" name="" value="0xcb" />
         <value caption="Interrupt 202 will initiate a DMA transfer" name="" value="0xca" />
         <value caption="Interrupt 201 will initiate a DMA transfer" name="" value="0xc9" />
         <value caption="Interrupt 200 will initiate a DMA transfer" name="" value="0xc8" />
         <value caption="Interrupt 199 will initiate a DMA transfer" name="" value="0xc7" />
         <value caption="Interrupt 198 will initiate a DMA transfer" name="" value="0xc6" />
         <value caption="Interrupt 197 will initiate a DMA transfer" name="" value="0xc5" />
         <value caption="Interrupt 196 will initiate a DMA transfer" name="" value="0xc4" />
         <value caption="Interrupt 195 will initiate a DMA transfer" name="" value="0xc3" />
         <value caption="Interrupt 194 will initiate a DMA transfer" name="" value="0xc2" />
         <value caption="Interrupt 193 will initiate a DMA transfer" name="" value="0xc1" />
         <value caption="Interrupt 192 will initiate a DMA transfer" name="" value="0xc0" />
         <value caption="Interrupt 191 will initiate a DMA transfer" name="" value="0xbf" />
         <value caption="Interrupt 190 will initiate a DMA transfer" name="" value="0xbe" />
         <value caption="Interrupt 189 will initiate a DMA transfer" name="" value="0xbd" />
         <value caption="Interrupt 188 will initiate a DMA transfer" name="" value="0xbc" />
         <value caption="Interrupt 187 will initiate a DMA transfer" name="" value="0xbb" />
         <value caption="Interrupt 186 will initiate a DMA transfer" name="" value="0xba" />
         <value caption="Interrupt 185 will initiate a DMA transfer" name="" value="0xb9" />
         <value caption="Interrupt 184 will initiate a DMA transfer" name="" value="0xb8" />
         <value caption="Interrupt 183 will initiate a DMA transfer" name="" value="0xb7" />
         <value caption="Interrupt 182 will initiate a DMA transfer" name="" value="0xb6" />
         <value caption="Interrupt 181 will initiate a DMA transfer" name="" value="0xb5" />
         <value caption="Interrupt 180 will initiate a DMA transfer" name="" value="0xb4" />
         <value caption="Interrupt 179 will initiate a DMA transfer" name="" value="0xb3" />
         <value caption="Interrupt 178 will initiate a DMA transfer" name="" value="0xb2" />
         <value caption="Interrupt 177 will initiate a DMA transfer" name="" value="0xb1" />
         <value caption="Interrupt 176 will initiate a DMA transfer" name="" value="0xb0" />
         <value caption="Interrupt 175 will initiate a DMA transfer" name="" value="0xaf" />
         <value caption="Interrupt 174 will initiate a DMA transfer" name="" value="0xae" />
         <value caption="Interrupt 173 will initiate a DMA transfer" name="" value="0xad" />
         <value caption="Interrupt 172 will initiate a DMA transfer" name="" value="0xac" />
         <value caption="Interrupt 171 will initiate a DMA transfer" name="" value="0xab" />
         <value caption="Interrupt 170 will initiate a DMA transfer" name="" value="0xaa" />
         <value caption="Interrupt 169 will initiate a DMA transfer" name="" value="0xa9" />
         <value caption="Interrupt 168 will initiate a DMA transfer" name="" value="0xa8" />
         <value caption="Interrupt 167 will initiate a DMA transfer" name="" value="0xa7" />
         <value caption="Interrupt 166 will initiate a DMA transfer" name="" value="0xa6" />
         <value caption="Interrupt 165 will initiate a DMA transfer" name="" value="0xa5" />
         <value caption="Interrupt 164 will initiate a DMA transfer" name="" value="0xa4" />
         <value caption="Interrupt 163 will initiate a DMA transfer" name="" value="0xa3" />
         <value caption="Interrupt 162 will initiate a DMA transfer" name="" value="0xa2" />
         <value caption="Interrupt 161 will initiate a DMA transfer" name="" value="0xa1" />
         <value caption="Interrupt 160 will initiate a DMA transfer" name="" value="0xa0" />
         <value caption="Interrupt 159 will initiate a DMA transfer" name="" value="0x9f" />
         <value caption="Interrupt 158 will initiate a DMA transfer" name="" value="0x9e" />
         <value caption="Interrupt 157 will initiate a DMA transfer" name="" value="0x9d" />
         <value caption="Interrupt 156 will initiate a DMA transfer" name="" value="0x9c" />
         <value caption="Interrupt 155 will initiate a DMA transfer" name="" value="0x9b" />
         <value caption="Interrupt 154 will initiate a DMA transfer" name="" value="0x9a" />
         <value caption="Interrupt 153 will initiate a DMA transfer" name="" value="0x99" />
         <value caption="Interrupt 152 will initiate a DMA transfer" name="" value="0x98" />
         <value caption="Interrupt 151 will initiate a DMA transfer" name="" value="0x97" />
         <value caption="Interrupt 150 will initiate a DMA transfer" name="" value="0x96" />
         <value caption="Interrupt 149 will initiate a DMA transfer" name="" value="0x95" />
         <value caption="Interrupt 148 will initiate a DMA transfer" name="" value="0x94" />
         <value caption="Interrupt 147 will initiate a DMA transfer" name="" value="0x93" />
         <value caption="Interrupt 146 will initiate a DMA transfer" name="" value="0x92" />
         <value caption="Interrupt 145 will initiate a DMA transfer" name="" value="0x91" />
         <value caption="Interrupt 144 will initiate a DMA transfer" name="" value="0x90" />
         <value caption="Interrupt 143 will initiate a DMA transfer" name="" value="0x8f" />
         <value caption="Interrupt 142 will initiate a DMA transfer" name="" value="0x8e" />
         <value caption="Interrupt 141 will initiate a DMA transfer" name="" value="0x8d" />
         <value caption="Interrupt 140 will initiate a DMA transfer" name="" value="0x8c" />
         <value caption="Interrupt 139 will initiate a DMA transfer" name="" value="0x8b" />
         <value caption="Interrupt 138 will initiate a DMA transfer" name="" value="0x8a" />
         <value caption="Interrupt 137 will initiate a DMA transfer" name="" value="0x89" />
         <value caption="Interrupt 136 will initiate a DMA transfer" name="" value="0x88" />
         <value caption="Interrupt 135 will initiate a DMA transfer" name="" value="0x87" />
         <value caption="Interrupt 134 will initiate a DMA transfer" name="" value="0x86" />
         <value caption="Interrupt 133 will initiate a DMA transfer" name="" value="0x85" />
         <value caption="Interrupt 132 will initiate a DMA transfer" name="" value="0x84" />
         <value caption="Interrupt 131 will initiate a DMA transfer" name="" value="0x83" />
         <value caption="Interrupt 130 will initiate a DMA transfer" name="" value="0x82" />
         <value caption="Interrupt 129 will initiate a DMA transfer" name="" value="0x81" />
         <value caption="Interrupt 128 will initiate a DMA transfer" name="" value="0x80" />
         <value caption="Interrupt 127 will initiate a DMA transfer" name="" value="0x7f" />
         <value caption="Interrupt 126 will initiate a DMA transfer" name="" value="0x7e" />
         <value caption="Interrupt 125 will initiate a DMA transfer" name="" value="0x7d" />
         <value caption="Interrupt 124 will initiate a DMA transfer" name="" value="0x7c" />
         <value caption="Interrupt 123 will initiate a DMA transfer" name="" value="0x7b" />
         <value caption="Interrupt 122 will initiate a DMA transfer" name="" value="0x7a" />
         <value caption="Interrupt 121 will initiate a DMA transfer" name="" value="0x79" />
         <value caption="Interrupt 120 will initiate a DMA transfer" name="" value="0x78" />
         <value caption="Interrupt 119 will initiate a DMA transfer" name="" value="0x77" />
         <value caption="Interrupt 118 will initiate a DMA transfer" name="" value="0x76" />
         <value caption="Interrupt 117 will initiate a DMA transfer" name="" value="0x75" />
         <value caption="Interrupt 116 will initiate a DMA transfer" name="" value="0x74" />
         <value caption="Interrupt 115 will initiate a DMA transfer" name="" value="0x73" />
         <value caption="Interrupt 114 will initiate a DMA transfer" name="" value="0x72" />
         <value caption="Interrupt 113 will initiate a DMA transfer" name="" value="0x71" />
         <value caption="Interrupt 112 will initiate a DMA transfer" name="" value="0x70" />
         <value caption="Interrupt 111 will initiate a DMA transfer" name="" value="0x6f" />
         <value caption="Interrupt 110 will initiate a DMA transfer" name="" value="0x6e" />
         <value caption="Interrupt 109 will initiate a DMA transfer" name="" value="0x6d" />
         <value caption="Interrupt 108 will initiate a DMA transfer" name="" value="0x6c" />
         <value caption="Interrupt 107 will initiate a DMA transfer" name="" value="0x6b" />
         <value caption="Interrupt 106 will initiate a DMA transfer" name="" value="0x6a" />
         <value caption="Interrupt 105 will initiate a DMA transfer" name="" value="0x69" />
         <value caption="Interrupt 104 will initiate a DMA transfer" name="" value="0x68" />
         <value caption="Interrupt 103 will initiate a DMA transfer" name="" value="0x67" />
         <value caption="Interrupt 102 will initiate a DMA transfer" name="" value="0x66" />
         <value caption="Interrupt 101 will initiate a DMA transfer" name="" value="0x65" />
         <value caption="Interrupt 100 will initiate a DMA transfer" name="" value="0x64" />
         <value caption="Interrupt 99 will initiate a DMA transfer" name="" value="0x63" />
         <value caption="Interrupt 98 will initiate a DMA transfer" name="" value="0x62" />
         <value caption="Interrupt 97 will initiate a DMA transfer" name="" value="0x61" />
         <value caption="Interrupt 96 will initiate a DMA transfer" name="" value="0x60" />
         <value caption="Interrupt 95 will initiate a DMA transfer" name="" value="0x5f" />
         <value caption="Interrupt 94 will initiate a DMA transfer" name="" value="0x5e" />
         <value caption="Interrupt 93 will initiate a DMA transfer" name="" value="0x5d" />
         <value caption="Interrupt 92 will initiate a DMA transfer" name="" value="0x5c" />
         <value caption="Interrupt 91 will initiate a DMA transfer" name="" value="0x5b" />
         <value caption="Interrupt 90 will initiate a DMA transfer" name="" value="0x5a" />
         <value caption="Interrupt 89 will initiate a DMA transfer" name="" value="0x59" />
         <value caption="Interrupt 88 will initiate a DMA transfer" name="" value="0x58" />
         <value caption="Interrupt 87 will initiate a DMA transfer" name="" value="0x57" />
         <value caption="Interrupt 86 will initiate a DMA transfer" name="" value="0x56" />
         <value caption="Interrupt 85 will initiate a DMA transfer" name="" value="0x55" />
         <value caption="Interrupt 84 will initiate a DMA transfer" name="" value="0x54" />
         <value caption="Interrupt 83 will initiate a DMA transfer" name="" value="0x53" />
         <value caption="Interrupt 82 will initiate a DMA transfer" name="" value="0x52" />
         <value caption="Interrupt 81 will initiate a DMA transfer" name="" value="0x51" />
         <value caption="Interrupt 80 will initiate a DMA transfer" name="" value="0x50" />
         <value caption="Interrupt 79 will initiate a DMA transfer" name="" value="0x4f" />
         <value caption="Interrupt 78 will initiate a DMA transfer" name="" value="0x4e" />
         <value caption="Interrupt 77 will initiate a DMA transfer" name="" value="0x4d" />
         <value caption="Interrupt 76 will initiate a DMA transfer" name="" value="0x4c" />
         <value caption="Interrupt 75 will initiate a DMA transfer" name="" value="0x4b" />
         <value caption="Interrupt 74 will initiate a DMA transfer" name="" value="0x4a" />
         <value caption="Interrupt 73 will initiate a DMA transfer" name="" value="0x49" />
         <value caption="Interrupt 72 will initiate a DMA transfer" name="" value="0x48" />
         <value caption="Interrupt 71 will initiate a DMA transfer" name="" value="0x47" />
         <value caption="Interrupt 70 will initiate a DMA transfer" name="" value="0x46" />
         <value caption="Interrupt 69 will initiate a DMA transfer" name="" value="0x45" />
         <value caption="Interrupt 68 will initiate a DMA transfer" name="" value="0x44" />
         <value caption="Interrupt 67 will initiate a DMA transfer" name="" value="0x43" />
         <value caption="Interrupt 66 will initiate a DMA transfer" name="" value="0x42" />
         <value caption="Interrupt 65 will initiate a DMA transfer" name="" value="0x41" />
         <value caption="Interrupt 64 will initiate a DMA transfer" name="" value="0x40" />
         <value caption="Interrupt 63 will initiate a DMA transfer" name="" value="0x3f" />
         <value caption="Interrupt 62 will initiate a DMA transfer" name="" value="0x3e" />
         <value caption="Interrupt 61 will initiate a DMA transfer" name="" value="0x3d" />
         <value caption="Interrupt 60 will initiate a DMA transfer" name="" value="0x3c" />
         <value caption="Interrupt 59 will initiate a DMA transfer" name="" value="0x3b" />
         <value caption="Interrupt 58 will initiate a DMA transfer" name="" value="0x3a" />
         <value caption="Interrupt 57 will initiate a DMA transfer" name="" value="0x39" />
         <value caption="Interrupt 56 will initiate a DMA transfer" name="" value="0x38" />
         <value caption="Interrupt 55 will initiate a DMA transfer" name="" value="0x37" />
         <value caption="Interrupt 54 will initiate a DMA transfer" name="" value="0x36" />
         <value caption="Interrupt 53 will initiate a DMA transfer" name="" value="0x35" />
         <value caption="Interrupt 52 will initiate a DMA transfer" name="" value="0x34" />
         <value caption="Interrupt 51 will initiate a DMA transfer" name="" value="0x33" />
         <value caption="Interrupt 50 will initiate a DMA transfer" name="" value="0x32" />
         <value caption="Interrupt 49 will initiate a DMA transfer" name="" value="0x31" />
         <value caption="Interrupt 48 will initiate a DMA transfer" name="" value="0x30" />
         <value caption="Interrupt 47 will initiate a DMA transfer" name="" value="0x2f" />
         <value caption="Interrupt 46 will initiate a DMA transfer" name="" value="0x2e" />
         <value caption="Interrupt 45 will initiate a DMA transfer" name="" value="0x2d" />
         <value caption="Interrupt 44 will initiate a DMA transfer" name="" value="0x2c" />
         <value caption="Interrupt 43 will initiate a DMA transfer" name="" value="0x2b" />
         <value caption="Interrupt 42 will initiate a DMA transfer" name="" value="0x2a" />
         <value caption="Interrupt 41 will initiate a DMA transfer" name="" value="0x29" />
         <value caption="Interrupt 40 will initiate a DMA transfer" name="" value="0x28" />
         <value caption="Interrupt 39 will initiate a DMA transfer" name="" value="0x27" />
         <value caption="Interrupt 38 will initiate a DMA transfer" name="" value="0x26" />
         <value caption="Interrupt 37 will initiate a DMA transfer" name="" value="0x25" />
         <value caption="Interrupt 36 will initiate a DMA transfer" name="" value="0x24" />
         <value caption="Interrupt 35 will initiate a DMA transfer" name="" value="0x23" />
         <value caption="Interrupt 34 will initiate a DMA transfer" name="" value="0x22" />
         <value caption="Interrupt 33 will initiate a DMA transfer" name="" value="0x21" />
         <value caption="Interrupt 32 will initiate a DMA transfer" name="" value="0x20" />
         <value caption="Interrupt 31 will initiate a DMA transfer" name="" value="0x1f" />
         <value caption="Interrupt 30 will initiate a DMA transfer" name="" value="0x1e" />
         <value caption="Interrupt 29 will initiate a DMA transfer" name="" value="0x1d" />
         <value caption="Interrupt 28 will initiate a DMA transfer" name="" value="0x1c" />
         <value caption="Interrupt 27 will initiate a DMA transfer" name="" value="0x1b" />
         <value caption="Interrupt 26 will initiate a DMA transfer" name="" value="0x1a" />
         <value caption="Interrupt 25 will initiate a DMA transfer" name="" value="0x19" />
         <value caption="Interrupt 24 will initiate a DMA transfer" name="" value="0x18" />
         <value caption="Interrupt 23 will initiate a DMA transfer" name="" value="0x17" />
         <value caption="Interrupt 22 will initiate a DMA transfer" name="" value="0x16" />
         <value caption="Interrupt 21 will initiate a DMA transfer" name="" value="0x15" />
         <value caption="Interrupt 20 will initiate a DMA transfer" name="" value="0x14" />
         <value caption="Interrupt 19 will initiate a DMA transfer" name="" value="0x13" />
         <value caption="Interrupt 18 will initiate a DMA transfer" name="" value="0x12" />
         <value caption="Interrupt 17 will initiate a DMA transfer" name="" value="0x11" />
         <value caption="Interrupt 16 will initiate a DMA transfer" name="" value="0x10" />
         <value caption="Interrupt 15 will initiate a DMA transfer" name="" value="0xf" />
