MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX570F512H.atdf
         <register caption="" name="RPB2R" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB2R" />
         </register>
         <register caption="" name="RPB3R" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB3R" />
         </register>
         <register caption="" name="RPB4R" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB4R" />
         </register>
         <register caption="" name="RPB5R" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB5R" />
         </register>
         <register caption="" name="RPB6R" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB6R" />
         </register>
         <register caption="" name="RPB7R" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB7R" />
         </register>
         <register caption="" name="RPB8R" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB8R" />
         </register>
         <register caption="" name="RPB9R" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB9R" />
         </register>
         <register caption="" name="RPB10R" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB10R" />
         </register>
         <register caption="" name="RPB11R" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB11R" />
         </register>
         <register caption="" name="RPB12R" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB12R" />
         </register>
         <register caption="" name="RPB13R" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB13R" />
         </register>
         <register caption="" name="RPB14R" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB14R" />
         </register>
         <register caption="" name="RPB15R" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB15R" />
         </register>
         <register caption="" name="RPC0R" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC0R" />
         </register>
         <register caption="" name="RPC1R" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC1R" />
         </register>
         <register caption="" name="RPC2R" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC2R" />
         </register>
         <register caption="" name="RPC3R" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC3R" />
         </register>
         <register caption="" name="RPC4R" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC4R" />
         </register>
         <register caption="" name="RPC5R" offset="0x94" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC5R" />
         </register>
         <register caption="" name="RPC6R" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC6R" />
         </register>
         <register caption="" name="RPC7R" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC7R" />
         </register>
         <register caption="" name="RPC8R" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC8R" />
         </register>
         <register caption="" name="RPC9R" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC9R" />
         </register>
         <register caption="" name="RPC10R" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC10R" />
         </register>
         <register caption="" name="RPC11R" offset="0xac" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC11R" />
         </register>
         <register caption="" name="RPC12R" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC12R" />
         </register>
         <register caption="" name="RPC13R" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC13R" />
         </register>
         <register caption="" name="RPC14R" offset="0xb8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC14R" />
         </register>
         <register caption="" name="RPC15R" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC15R" />
         </register>
         <register caption="" name="RPD0R" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD0R" />
         </register>
         <register caption="" name="RPD1R" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD1R" />
         </register>
         <register caption="" name="RPD2R" offset="0xc8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD2R" />
         </register>
         <register caption="" name="RPD3R" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD3R" />
         </register>
         <register caption="" name="RPD4R" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD4R" />
         </register>
         <register caption="" name="RPD5R" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD5R" />
         </register>
         <register caption="" name="RPD6R" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD6R" />
         </register>
         <register caption="" name="RPD7R" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD7R" />
         </register>
         <register caption="" name="RPD8R" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD8R" />
         </register>
         <register caption="" name="RPD9R" offset="0xe4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD9R" />
         </register>
         <register caption="" name="RPD10R" offset="0xe8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD10R" />
         </register>
         <register caption="" name="RPD11R" offset="0xec" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD11R" />
         </register>
         <register caption="" name="RPD12R" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD12R" />
         </register>
         <register caption="" name="RPD13R" offset="0xf4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD13R" />
         </register>
         <register caption="" name="RPD14R" offset="0xf8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD14R" />
         </register>
